from abc import ABC, abstractmethod


class StorageAbs(ABC):
    """
    Абстрактний клас опису збереження та зчитування даних бібліотеки
    """
    @abstractmethod
    def load(self, obj_classname: str) -> tuple :
        """
        Метод має зчитувати весь перелік книг або читачів з якогось джерела
        Перевіряти коректність даних. Не коректні записи мають ігноруються.

        :param obj_classname: Назва класу об'єктів, що очікується зчитати
        :return: Кортеж із 3-х значень:
                  0.) перелік (list) цільових об'єктів.
                  1.) число. максимальний uin цільових об'єктів, який необхідно передати бібліотеці
        """
        pass

    @abstractmethod
    def dump(self, list_obj: list, obj_classname: str, max_uin: int = None) -> bool:
        """
        Метод має записувати весь перелік книг або читачів в якесь джерело

        :param list_obj: перелік (list) цільових об'єктів, що підлягають запису.
        :param obj_classname: Назва класу об'єктів, що записуються
        :param max_uin: Максимальний унікальний номер об'єкту (Для збереження у файл)
        :return:  Ознаку успішності запису.
        """
        pass
